In [1]:
import numpy as np
import pandas as pd

# Operations In Numpy

In [33]:
#making a array
k = np.array([1,2,3,4,5,6,7,8])
print(k)

[1 2 3 4 5 6 7 8]

In [34]:
#print the shape of the array,how many row and column in the array
print(k.shape)

(8,)

In [35]:
#change the shape and dimension and shape of the array
print(k.reshape(2,2,2))

[[[1 2]
  [3 4]]

 [[5 6]
  [7 8]]]

In [36]:
x= np.array(['raghav','ram','krishna','aryan'])
y= [True,True,True,False]
z= x[y]
print(z)
print(x[::-1])

['raghav' 'ram' 'krishna']
['aryan' 'krishna' 'ram' 'raghav']

In [37]:
print(k[2]+k[5])    #addition
print(k[2]-k[5])    #subtraction
print(k[2]*k[5])    #multiplication
print(k[2]/k[5])    #division
print(k[2]%k[5])    #modulus
print(k[2]//k[5])   #floor division
print(k[2]**k[5])   #exponentiation

9
-3
18
0.5
3
0
729

In [38]:
print(k[5])

6

In [39]:
np.savetxt('library_numpy.csv',k)#save a file in csv form
arr12=np.loadtxt('library_numpy.csv')#load a file back from csv form
print(arr12)

[1. 2. 3. 4. 5. 6. 7. 8.]

In [40]:
np.save('library_numpy.npy',k)#save a file in binary form
arr12=np.load('library_numpy.npy') #load a file back from binary form
print(arr12)

[1 2 3 4 5 6 7 8]

In [41]:
print(np.sum(k))

36

In [42]:
print(np.mean(k))
print(np.median(k))

4.5
4.5

In [43]:
p=np.array([1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16])
f = p.reshape(4,2,2)
print(f)

[[[ 1  2]
  [ 3  4]]

 [[ 5  6]
  [ 7  8]]

 [[ 9 10]
  [11 12]]

 [[13 14]
  [15 16]]]

In [44]:
#ndim function is use for finding the dimension of the function
#dtype function is used for findinf data type of the function
print(k.ndim)
print(k.dtype)
print(type(k))

1
int32
<class 'numpy.ndarray'>

In [45]:
#copy function is used for getting copy of the array and if we do any changes in the copy it do not effect orignal one
j=k.copy()
j[2]=16
print(j)

[ 1  2 16  4  5  6  7  8]

In [46]:
print(k)

[1 2 3 4 5 6 7 8]

In [47]:
#is help to sort the array
print(np.sort(k))

[1 2 3 4 5 6 7 8]

In [48]:
print(np.sort(x))

['aryan' 'krishna' 'raghav' 'ram']

In [49]:
from numpy import random
#suffle use to suffle the the element in orignal array
#permutation is also used to suffle the element but permutation makes the copy of the array and shuffle it
print(np.random.shuffle(k))
print(np.random.permutation(k))

None
[4 1 5 8 6 3 7 2]

In [50]:
from numpy import linalg
r = np.array([3,42,445,2,5,7,46,2])
print(np.dot(k,r))#.dot is used to find the dot product between the array
print(np.matmul(k,j))#matmull is also used for multiplication between matrix but it is not flexible like .dot becaude it follow mathematical rule.
print(np.linalg.det(f))#.det is used to find the determinant of the matrix
print(np.linalg.inv(f))#.inv is used to find the inverse of the matrix
print(np.linalg.matrix_rank(f))#.matrix_rank is used to find the rank of the matrix

1021
198
[-2. -2. -2. -2.]
[[[-2.   1. ]
  [ 1.5 -0.5]]

 [[-4.   3. ]
  [ 3.5 -2.5]]

 [[-6.   5. ]
  [ 5.5 -4.5]]

 [[-8.   7. ]
  [ 7.5 -6.5]]]
[2 2 2 2]

In [51]:
np.random.seed(1)#is used to not change the array which is given to random function
print(np.random.rand(3,3))#is used to give the number in the whole number scale
print(np.random.randint(1,10,(3,3)))#is used to give umber in a prper range
print(np.random.choice(['a','t','r','t','s',2,4,5],5))#is used to choose randomely elemnt is array ehich is given
print(np.random.choice(['a','t','r','t','s',2,4,5],size =(3,3)))#is used to make a matrix from the given array in randomely choose the element

[[4.17022005e-01 7.20324493e-01 1.14374817e-04]
 [3.02332573e-01 1.46755891e-01 9.23385948e-02]
 [1.86260211e-01 3.45560727e-01 3.96767474e-01]]
[[3 5 6]
 [3 5 3]
 [5 8 8]]
['t' 't' '5' '4' 'a']
[['4' '2' 't']
 ['t' '5' '5']
 ['2' '4' 't']]

# Operatins In Pandas

In [53]:
data= {"name" :['Aman','Athrav','Aryan','Aditya'],
       "age" : [18,19,20,21],
       "city" : ['Delhi','Nagpur','Raipur','Banglore']}
g=pd.DataFrame(data)
print(g)

     name  age      city
0    Aman   18     Delhi
1  Athrav   19    Nagpur
2   Aryan   20    Raipur
3  Aditya   21  Banglore

In [54]:
#print first two row of the data set
print(g.head(2))

     name  age    city
0    Aman   18   Delhi
1  Athrav   19  Nagpur

In [55]:
#print last two row of data set
print(g.tail(3))

     name  age      city
1  Athrav   19    Nagpur
2   Aryan   20    Raipur
3  Aditya   21  Banglore

In [56]:
#give the general information about the dataset
print(g.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   city    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes
None

In [57]:
#give the answer of statical operation perform in the dataset
print(g.describe())

             age
count   4.000000
mean   19.500000
std     1.290994
min    18.000000
25%    18.750000
50%    19.500000
75%    20.250000
max    21.000000

In [58]:
#give the indexing in the dataset
g=pd.DataFrame(data , index = ['a','b','c','d'])
print(g)

     name  age      city
a    Aman   18     Delhi
b  Athrav   19    Nagpur
c   Aryan   20    Raipur
d  Aditya   21  Banglore

In [59]:
#give the values of specific row in the dataset
print(g.loc['d'])

name      Aditya
age           21
city    Banglore
Name: d, dtype: object

In [63]:
#give the value of specific column in specific data set
print(g.iloc[2,2])

Raipur

In [64]:
#sort the value with respect to given condition in bolean form
print(g['age']<19)

a     True
b    False
c    False
d    False
Name: age, dtype: bool

In [66]:
#sort the value with respect to given condition
print(g[g['age']<20])

     name  age    city
a    Aman   18   Delhi
b  Athrav   19  Nagpur

In [67]:
#save the file in csv format
g.to_csv('output.csv', index=False)

In [68]:
#save the file in excel format
g.to_excel('output.xlsx', index=False)

In [69]:
#find if there any null value in the dataset
g.isnull().sum()

name    0
age     0
city    0
dtype: int64

In [70]:
#fill the temparory value in the space of null value
g.fillna(0)

     name  age      city
a    Aman   18     Delhi
b  Athrav   19    Nagpur
c   Aryan   20    Raipur
d  Aditya   21  Banglore

In [72]:
#drop the null value from the dataset
g.dropna()

     name  age      city
a    Aman   18     Delhi
b  Athrav   19    Nagpur
c   Aryan   20    Raipur
d  Aditya   21  Banglore

In [73]:
#find the duplicated vaue in the dataset
g.duplicated().sum()

0

In [74]:
#drop the duplicated value from the dataset
g.drop_duplicates()

     name  age      city
a    Aman   18     Delhi
b  Athrav   19    Nagpur
c   Aryan   20    Raipur
d  Aditya   21  Banglore